lvx/base/ChartsOfCharacteristicTypes/бит_ВидыПроизвольныхПараметров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>бит_ВидыПроизвольныхПараметров</Name>
			<Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>19</v8:Digits>
					<v8:FractionDigits>6</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>250</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоАналитик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИспользованиеАналитики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяИзмерения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяТипаПоУмолчанию</Name>
							<Comment>Тип значения по умолчанию для аналитики составного типа</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

lvx/base/ChartsOfCharacteristicTypes/бит_ВидыПроизвольныхПараметров/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Функция формирует структуры связей имен измерений параметров и измерений бюджетирования.
// 
// Параметры:
//   ВидПараметра - ПланВидовХарактеристикСсылка.бит_ВидыПроизвольныхПараметров.
// 
// Возвращаемое значение:
//  Имена - Структура.
// 
Функция ПодготовитьСтруктурыСвязи(ВидПараметра) Экспорт
	
	Имена = Новый Структура;
	// По имени измерения бюджетирования определяем имя измерения значения параметров.
	Имена.Вставить("БП", Новый Структура);
	// По имени измерения параметров определяем имя измерения бюджетирования.
	Имена.Вставить("ПБ", Новый Структура);
	
	Если ЗначениеЗаполнено(ВидПараметра) Тогда
		
		ИзмеренияБюдж = бит_Бюджетирование.НастройкиИзмеренийБюджетирования();
		
		Для каждого СтрокаТаблицы Из ВидПараметра.ИспользованиеАналитики Цикл
			
			Аналитика              = СтрокаТаблицы.Аналитика;
			ИмяАналитики           = СокрЛП(Аналитика.Код);
			ИмяИзмеренияПараметров = СокрЛП(СтрокаТаблицы.ИмяИзмерения);
			
			СовпадениеПоАналитике      = Ложь;
			ИмяАналитикиБюджетирования = "";
			
			Для каждого КиЗ Из ИзмеренияБюдж Цикл
				
				НастройкиБюдж = КиЗ.Значение;
				ИмяБюдж       = СокрЛП(КиЗ.Ключ);
				
				Если НастройкиБюдж = Неопределено Тогда
					Продолжить;
				КонецЕсли;
					
				Если ВРег(ИмяАналитики) = ВРег(ИмяБюдж) Тогда
					// 1й приоритет: Совпадение по именам.
					ИмяАналитикиБюджетирования = ИмяБюдж;
					Прервать;
				КонецЕсли;
				
				Если СтрокаТаблицы.Аналитика = НастройкиБюдж.Аналитика Тогда
					// 2й приориет: Совпадение по аналитикам.
					ИмяАналитикиБюджетирования = ИмяБюдж;
					СовпадениеПоАналитике      = Истина;
				КонецЕсли;
				
				Если СовпадениеПоАналитике Тогда
					Продолжить; // Если уже найдено совпадение по аналитике, выполнять поиск по типам не требуется.
				КонецЕсли;
				
				Сравнение = Новый СравнениеЗначений;
				Если Сравнение.Сравнить(СтрокаТаблицы.Аналитика.ТипЗначения, НастройкиБюдж.ТипЗначения) = 0 Тогда
					ИмяАналитикиБюджетирования = ИмяБюдж;
				КонецЕсли;
				
			КонецЦикла; // ИзмеренияБюдж
			
			Если НЕ ПустаяСтрока(ИмяАналитикиБюджетирования) Тогда
				Имена.БП.Вставить(ИмяАналитикиБюджетирования, ИмяИзмеренияПараметров);
				Имена.ПБ.Вставить(ИмяИзмеренияПараметров, ИмяАналитикиБюджетирования);
			КонецЕсли;
			
		КонецЦикла; // ВидПараметра.ИспользованиеАналитики
		
	КонецЕсли;
	
	Возврат Имена;
	
КонецФункции

// Обработчик обновления версии 3.1.45.
// См. документацию БСП - Отложенное обновление больших архивов данных.
//
// Параметры:
//  Параметры - Структура - содержит необходимый для последующей обработки признак ОбработкаЗавершена.
Процедура ЗаполнитьКоличествоАналитик(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АналитикиПроизвольныхПараметров.Ссылка КАК Ссылка,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АналитикиПроизвольныхПараметров.НомерСтроки) КАК КоличествоАналитик
	|ИЗ
	|	ПланВидовХарактеристик.бит_ВидыПроизвольныхПараметров.ИспользованиеАналитики КАК АналитикиПроизвольныхПараметров
	|
	|СГРУППИРОВАТЬ ПО
	|	АналитикиПроизвольныхПараметров.Ссылка
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АналитикиПроизвольныхПараметров.НомерСтроки) <> АналитикиПроизвольныхПараметров.Ссылка.КоличествоАналитик";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = Ложь;
	
	ПроблемныхОбъектов = 0;
	ОбъектовОбработано = 0;
	
	ВыборкаПараметров = РезультатЗапроса.Выбрать();
	Пока ВыборкаПараметров.Следующий() Цикл
		
		Попытка
			ПроизовольныйПараметр = ВыборкаПараметров.Ссылка.ПолучитьОбъект();
			ПроизовольныйПараметр.КоличествоАналитик = ВыборкаПараметров.КоличествоАналитик;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ПроизовольныйПараметр);
			
			ОбъектовОбработано = ОбъектовОбработано + 1;
		Исключение
			// Если не удалось обработать, повторяем попытку снова.
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось установить свойства количеста объектов для элемента ""%1"" по причине:
										|%2';
										|en = 'Не удалось установить свойства количеста объектов для элемента ""%1"" по причине:
										|%2'"), ПроизовольныйПараметр, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
							УровеньЖурналаРегистрации.Предупреждение,
							Метаданные.ПланыВидовХарактеристик.бит_ВидыПроизвольныхПараметров, ПроизовольныйПараметр, ТекстСообщения);
		КонецПопытки;
		
	КонецЦикла;
	
	Если ОбъектовОбработано = 0 Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Процедуре ЗаполнитьКоличествоАналитик
									|не удалось перенести записи для некоторых элементов (пропущены): %1';
									|en = 'Процедуре ПеренестиЗначенийПроизвольныхПоказателей
									|не удалось перенести записи для некоторых элементов (пропущены): %1'"),
							ПроблемныхОбъектов);
		ВызватьИсключение ТекстСообщения;
	Иначе
		Параметры.ОбработкаЗавершена = Истина;
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
			УровеньЖурналаРегистрации.Информация,
			Метаданные.ПланыВидовХарактеристик.бит_ВидыПроизвольныхПараметров,,
			СтрШаблон(НСтр("ru = 'Процедура ЗаполнитьКоличествоАналитик
							|выполнила заполнение элементов справочника ""Виды произвольных параметров"": %1';
							|en = 'Процедура ЗаполнитьКоличествоАналитик
							|выполнила заполнение элементов справочника ""Виды произвольных параметров"": %1'"), ОбъектовОбработано));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
 
#КонецЕсли
